app/Http/Controllers/Ojisan/OjisanRegisteredController.php

insert into `ojisans` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('ojisan1', 'ojisan1@gmail.com', '$2y$12$l1BCZLpaBM/JPFwCDsx3AetqI517p/O.kND3NE4WW3AuEC53H.bay', '2023-11-07 11:17:42', '2023-11-07 11:17:42')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.Ojisan::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $ojisan = Ojisan::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);